app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("name", "images", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "multi files"], ["images", "[\"Grunge-Sky-grunge-sky-1920x1200vjpg.jpg\"]"], ["created_at", "2016-02-09 13:00:06.227329"], ["updated_at", "2016-02-09 13:00:06.227329"]]

    def set_account
      @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT 1  [["id", 1]]